results/pass-previous.txt
Run: pass
Mode: pass
Started: 2026-09-21T09:24:59.804Z
Git HEAD: cd8724a2235f772747dd7dace64bf4a4105f18cd
Command: k6 run --no-color --summary-mode full --summary-export results/pass.json slo-test.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: slo-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 20 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 20 VUs  0m01.0s/1m0s

running (0m02.0s), 20/20 VUs, 20 complete and 0 interrupted iterations
default   [   3% ] 20 VUs  0m02.0s/1m0s

running (0m03.0s), 20/20 VUs, 40 complete and 0 interrupted iterations
default   [   5% ] 20 VUs  0m03.0s/1m0s

running (0m04.0s), 20/20 VUs, 56 complete and 0 interrupted iterations
default   [   7% ] 20 VUs  0m04.0s/1m0s

running (0m05.0s), 20/20 VUs, 60 complete and 0 interrupted iterations
default   [   8% ] 20 VUs  0m05.0s/1m0s

running (0m06.0s), 20/20 VUs, 80 complete and 0 interrupted iterations
default   [  10% ] 20 VUs  0m06.0s/1m0s

running (0m07.0s), 20/20 VUs, 100 complete and 0 interrupted iterations
default   [  12% ] 20 VUs  0m07.0s/1m0s

running (0m08.0s), 20/20 VUs, 117 complete and 0 interrupted iterations
default   [  13% ] 20 VUs  0m08.0s/1m0s

running (0m09.0s), 20/20 VUs, 121 complete and 0 interrupted iterations
default   [  15% ] 20 VUs  0m09.0s/1m0s

running (0m10.0s), 20/20 VUs, 140 complete and 0 interrupted iterations
default   [  17% ] 20 VUs  0m10.0s/1m0s

running (0m11.0s), 20/20 VUs, 160 complete and 0 interrupted iterations
default   [  18% ] 20 VUs  0m11.0s/1m0s

running (0m12.0s), 20/20 VUs, 175 complete and 0 interrupted iterations
default   [  20% ] 20 VUs  0m12.0s/1m0s

running (0m13.0s), 20/20 VUs, 183 complete and 0 interrupted iterations
default   [  22% ] 20 VUs  0m13.0s/1m0s

running (0m14.0s), 20/20 VUs, 200 complete and 0 interrupted iterations
default   [  23% ] 20 VUs  0m14.0s/1m0s

running (0m15.0s), 20/20 VUs, 220 complete and 0 interrupted iterations
default   [  25% ] 20 VUs  0m15.0s/1m0s

running (0m16.0s), 20/20 VUs, 236 complete and 0 interrupted iterations
default   [  27% ] 20 VUs  0m16.0s/1m0s

running (0m17.0s), 20/20 VUs, 246 complete and 0 interrupted iterations
default   [  28% ] 20 VUs  0m17.0s/1m0s

running (0m18.0s), 20/20 VUs, 261 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  0m18.0s/1m0s

running (0m19.0s), 20/20 VUs, 280 complete and 0 interrupted iterations
default   [  32% ] 20 VUs  0m19.0s/1m0s

running (0m20.0s), 20/20 VUs, 295 complete and 0 interrupted iterations
default   [  33% ] 20 VUs  0m20.0s/1m0s

running (0m21.0s), 20/20 VUs, 309 complete and 0 interrupted iterations
default   [  35% ] 20 VUs  0m21.0s/1m0s

running (0m22.0s), 20/20 VUs, 322 complete and 0 interrupted iterations
default   [  37% ] 20 VUs  0m22.0s/1m0s

running (0m23.0s), 20/20 VUs, 340 complete and 0 interrupted iterations
default   [  38% ] 20 VUs  0m23.0s/1m0s

running (0m24.0s), 20/20 VUs, 357 complete and 0 interrupted iterations
default   [  40% ] 20 VUs  0m24.0s/1m0s

running (0m25.0s), 20/20 VUs, 372 complete and 0 interrupted iterations
default   [  42% ] 20 VUs  0m25.0s/1m0s

running (0m26.0s), 20/20 VUs, 382 complete and 0 interrupted iterations
default   [  43% ] 20 VUs  0m26.0s/1m0s

running (0m27.0s), 20/20 VUs, 400 complete and 0 interrupted iterations
default   [  45% ] 20 VUs  0m27.0s/1m0s

running (0m28.0s), 20/20 VUs, 418 complete and 0 interrupted iterations
default   [  47% ] 20 VUs  0m28.0s/1m0s

running (0m29.0s), 20/20 VUs, 431 complete and 0 interrupted iterations
default   [  48% ] 20 VUs  0m29.0s/1m0s

running (0m30.0s), 20/20 VUs, 447 complete and 0 interrupted iterations
default   [  50% ] 20 VUs  0m30.0s/1m0s

running (0m31.0s), 20/20 VUs, 462 complete and 0 interrupted iterations
default   [  52% ] 20 VUs  0m31.0s/1m0s

running (0m32.0s), 20/20 VUs, 480 complete and 0 interrupted iterations
default   [  53% ] 20 VUs  0m32.0s/1m0s

running (0m33.0s), 20/20 VUs, 493 complete and 0 interrupted iterations
default   [  55% ] 20 VUs  0m33.0s/1m0s

running (0m34.0s), 20/20 VUs, 508 complete and 0 interrupted iterations
default   [  57% ] 20 VUs  0m34.0s/1m0s

running (0m35.0s), 20/20 VUs, 523 complete and 0 interrupted iterations
default   [  58% ] 20 VUs  0m35.0s/1m0s

running (0m36.0s), 20/20 VUs, 541 complete and 0 interrupted iterations
default   [  60% ] 20 VUs  0m36.0s/1m0s

running (0m37.0s), 20/20 VUs, 554 complete and 0 interrupted iterations
default   [  62% ] 20 VUs  0m37.0s/1m0s

running (0m38.0s), 20/20 VUs, 569 complete and 0 interrupted iterations
default   [  63% ] 20 VUs  0m38.0s/1m0s

running (0m39.0s), 20/20 VUs, 583 complete and 0 interrupted iterations
default   [  65% ] 20 VUs  0m39.0s/1m0s

running (0m40.0s), 20/20 VUs, 601 complete and 0 interrupted iterations
default   [  67% ] 20 VUs  0m40.0s/1m0s

running (0m41.0s), 20/20 VUs, 614 complete and 0 interrupted iterations
default   [  68% ] 20 VUs  0m41.0s/1m0s

running (0m42.0s), 20/20 VUs, 630 complete and 0 interrupted iterations
default   [  70% ] 20 VUs  0m42.0s/1m0s

running (0m43.0s), 20/20 VUs, 644 complete and 0 interrupted iterations
default   [  72% ] 20 VUs  0m43.0s/1m0s

running (0m44.0s), 20/20 VUs, 662 complete and 0 interrupted iterations
default   [  73% ] 20 VUs  0m44.0s/1m0s

running (0m45.0s), 20/20 VUs, 675 complete and 0 interrupted iterations
default   [  75% ] 20 VUs  0m45.0s/1m0s

running (0m46.0s), 20/20 VUs, 691 complete and 0 interrupted iterations
default   [  77% ] 20 VUs  0m46.0s/1m0s

running (0m47.0s), 20/20 VUs, 705 complete and 0 interrupted iterations
default   [  78% ] 20 VUs  0m47.0s/1m0s

running (0m48.0s), 20/20 VUs, 723 complete and 0 interrupted iterations
default   [  80% ] 20 VUs  0m48.0s/1m0s

running (0m49.0s), 20/20 VUs, 736 complete and 0 interrupted iterations
default   [  82% ] 20 VUs  0m49.0s/1m0s

running (0m50.0s), 20/20 VUs, 752 complete and 0 interrupted iterations
default   [  83% ] 20 VUs  0m50.0s/1m0s

running (0m51.0s), 20/20 VUs, 766 complete and 0 interrupted iterations
default   [  85% ] 20 VUs  0m51.0s/1m0s

running (0m52.0s), 20/20 VUs, 783 complete and 0 interrupted iterations
default   [  87% ] 20 VUs  0m52.0s/1m0s

running (0m53.0s), 20/20 VUs, 798 complete and 0 interrupted iterations
default   [  88% ] 20 VUs  0m53.0s/1m0s

running (0m54.0s), 20/20 VUs, 813 complete and 0 interrupted iterations
default   [  90% ] 20 VUs  0m54.0s/1m0s

running (0m55.0s), 20/20 VUs, 827 complete and 0 interrupted iterations
default   [  92% ] 20 VUs  0m55.0s/1m0s

running (0m56.0s), 20/20 VUs, 844 complete and 0 interrupted iterations
default   [  93% ] 20 VUs  0m56.0s/1m0s

running (0m57.0s), 20/20 VUs, 859 complete and 0 interrupted iterations
default   [  95% ] 20 VUs  0m57.0s/1m0s

running (0m58.0s), 20/20 VUs, 875 complete and 0 interrupted iterations
default   [  97% ] 20 VUs  0m58.0s/1m0s

running (0m59.0s), 20/20 VUs, 891 complete and 0 interrupted iterations
default   [  98% ] 20 VUs  0m59.0s/1m0s

running (1m00.0s), 20/20 VUs, 904 complete and 0 interrupted iterations
default   [ 100% ] 20 VUs  1m00.0s/1m0s

running (1m01.0s), 06/20 VUs, 918 complete and 0 interrupted iterations
default ↓ [ 100% ] 20 VUs  1m0s


  █ THRESHOLDS 

    checks
    ✓ 'rate>=0.90' rate=98.37%

    http_req_duration{name:cart}
    ✓ 'p(95)<1.235' p(95)=1.04ms

    http_req_duration{name:report}
    ✓ 'p(95)<450' p(95)=397.79ms

    http_req_failed{name:pay}
    ✓ 'rate<0.08' rate=4.87%


  █ TOTAL RESULTS 

    checks_total.......: 2772   45.217012/s
    checks_succeeded...: 98.37% 2727 out of 2772
    checks_failed......: 1.62%  45 out of 2772

    ✓ cart 200
    ✓ report 200
    ✗ pay 200
      ↳  95% — ✓ 879 / ✗ 45

    HTTP
    http_req_blocked...............: avg=17.13µs  min=0s       med=0s       max=2.13ms   p(95)=0s       p(99)=156.77µs count=2772
    http_req_connecting............: avg=15.4µs   min=0s       med=0s       max=2.13ms   p(95)=0s       p(99)=0s       count=2772
    http_req_duration..............: avg=103.78ms min=0s       med=660.95µs max=412.37ms p(95)=382ms    p(99)=401.41ms count=2772
      { expected_response:true }...: avg=105.48ms min=0s       med=676.3µs  max=412.37ms p(95)=382.18ms p(99)=401.7ms  count=2727
      { name:cart }................: avg=763.95µs min=0s       med=523.05µs max=17.16ms  p(95)=1.04ms   p(99)=12.87ms  count=924 
      { name:pay }.................: avg=455.97µs min=0s       med=508.4µs  max=3.6ms    p(95)=1.03ms   p(99)=1.4ms    count=924 
      { name:report }..............: avg=310.13ms min=201.37ms med=308.72ms max=412.37ms p(95)=397.79ms p(99)=408.36ms count=924 
    http_req_failed................: 1.62%  45 out of 2772
      { name:pay }.................: 4.87%  45 out of 924
    http_req_receiving.............: avg=154µs    min=0s       med=0s       max=1.35ms   p(95)=688.71µs p(99)=789.95µs count=2772
    http_req_sending...............: avg=6.72µs   min=0s       med=0s       max=1.01ms   p(95)=0s       p(99)=507.97µs count=2772
    http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(95)=0s       p(99)=0s       count=2772
    http_req_waiting...............: avg=103.62ms min=0s       med=537.65µs max=412.37ms p(95)=381.59ms p(99)=401.41ms count=2772
    http_reqs......................: 2772   45.217012/s

    EXECUTION
    iteration_duration.............: avg=1.31s    min=1.2s     med=1.31s    max=1.41s    p(95)=1.39s    p(99)=1.41s    count=924 
    iterations.....................: 924    15.072337/s
    vus............................: 6      min=6          max=20
    vus_max........................: 20     min=20         max=20

    NETWORK
    data_received..................: 696 kB 11 kB/s
    data_sent......................: 247 kB 4.0 kB/s



running (1m01.3s), 00/20 VUs, 924 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  1m0s

Finished: 2026-09-21T09:26:01.911Z
k6 exit code: 0
k6 signal: null

RUN VERIFICATION: pass | native k6 exit=0
http_req_duration{name:report}: {"avg":310.13495757575737,"min":201.374,"med":308.72235,"max":412.3749,"p(95)":397.79178499999995,"p(99)":408.362172,"count":924,"thresholds":{"p(95)<450":false}}
http_req_duration{name:cart}: {"p(95)":1.0483549999999997,"p(99)":12.870002999999992,"count":924,"avg":0.7639551948051947,"min":0,"med":0.52305,"max":17.1645,"thresholds":{"p(95)<1.235":false}}
http_req_failed{name:pay}: {"passes":45,"fails":879,"thresholds":{"rate<0.08":false},"value":0.048701298701298704}
checks: {"passes":2727,"fails":45,"thresholds":{"rate>=0.90":false},"value":0.9837662337662337}
Requests: {"count":2772,"rate":45.21701200229796}
Checks: {"passes":2727,"fails":45,"thresholds":{"rate>=0.90":false},"value":0.9837662337662337}